In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2100013083:stu2100013083@162.105.146.37:43306

In [3]:
%sql use stu2100013083;

 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.

[]

这个约束设计是用来维护关系模式上的函数依赖的。
先假定表𝑆𝑇𝐶(𝑠𝑛𝑜,𝑡𝑛𝑜,𝑐𝑛𝑜)上成立函数依赖𝑡𝑛𝑜→𝑐𝑛𝑜和(𝑠𝑛𝑜,𝑐𝑛𝑜)→𝑡𝑛𝑜， 它是满足3𝑁𝐹的；
𝐵𝐶𝑁𝐹设计则会把𝑆𝑇𝐶(𝑠𝑛𝑜,𝑡𝑛𝑜,𝑐𝑛𝑜)分解为𝑆𝐶(𝑠𝑛𝑜,𝑐𝑛𝑜)和𝑇𝐶(𝑡𝑛𝑜,𝑐𝑛𝑜)，这时只需要维护𝑇𝐶上的𝑡𝑛𝑜→𝑐𝑛𝑜。

In [5]:
%%sql
# 建表
CREATE TABLE IF NOT EXISTS STC
(
    sno INT,
    tno INT,
    cno INT,
    PRIMARY KEY (sno, tno, cno)
);
CREATE TABLE IF NOT EXISTS TC
(
    tno INT,
    cno INT,
    PRIMARY KEY (tno, cno)
);
CREATE TABLE IF NOT EXISTS SC
(
    sno INT,
    cno INT,
    PRIMARY KEY (sno, cno)
);

 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.

[]

1、数据准备。设置𝑠𝑛𝑜,𝑡𝑛𝑜, 𝑐𝑛𝑜的取值范围分别是，1-10000，1-1000，1-100，产生随机行，插入到一个临时表𝑡𝑚𝑝𝑆𝑇𝐶 ，去重后保证数据有至少100000行

In [6]:
import pandas as pd
import numpy as np

# 生成随机数据
data = {
    'sno': np.random.randint(1, 10001, size=120000),
    'tno': np.random.randint(1, 1001, size=120000),
    'cno': np.random.randint(1, 101, size=120000)
}
tmpSTC = pd.DataFrame(data)
# 去重
tmpSTC = tmpSTC.drop_duplicates()
tmpSTC.shape[0]

119990

2、使用触发器来实现𝑆𝑇𝐶以及𝑇𝐶上的这三个函数依赖

In [7]:
%%sql
CREATE TRIGGER Check_STC_Before_Insert
BEFORE INSERT ON STC
FOR EACH ROW
BEGIN
    # 检查某学生选定一门课，就对应一位老师的条件 (sno, cno) → tno
    IF EXISTS
    (
        SELECT 1 
        FROM STC 
        WHERE sno = NEW.sno AND cno = NEW.cno AND tno != NEW.tno
    )
    THEN
#         SET NEW.sno = NULL;  #设置为 NULL 之后处理
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'A student cannot have more than one teacher for the same course.';
    END IF;
    
    # 检查每位老师只教授一门课的条件 (tno → cno)
    IF EXISTS
    (
        SELECT 1 
        FROM STC 
        WHERE tno = NEW.tno AND cno != NEW.cno
    )
    THEN
#         SET NEW.sno = NULL;  #设置为 NULL 之后处理
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'A teacher cannot teach more than one course.';
    END IF;
END;

 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.

[]

简单测试一下触发器的功能

In [11]:
# 假设 sno 和 tno 和 cno 的组合是新的，不违反规则
%sql INSERT INTO STC (sno, tno, cno) VALUES (10001, 1001, 101);
%sql INSERT INTO STC (sno, tno, cno) VALUES (10002, 1002, 102);

# 插入一些不违反规则的记录
%sql INSERT INTO STC (sno, tno, cno) VALUES (10001, 1002, 102);
%sql INSERT INTO STC (sno, tno, cno) VALUES (10002, 1001, 101);

 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.

[]

In [12]:
# 现在尝试插入一个违反规则的记录，同一个 sno,cno 但不同的 tno
%sql INSERT INTO STC (sno, tno, cno) VALUES (10001, 1003, 101);

# 现在尝试插入一个违反规则的记录，同一个 tno 但不同的 cno
%sql INSERT INTO STC (sno, tno, cno) VALUES (10001, 1001, 103);

 * mysql://stu2100013083:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'A student cannot have more than one teacher for the same course.')
[SQL: INSERT INTO STC (sno, tno, cno) VALUES (10001, 1003, 101);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * mysql://stu2100013083:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'A teacher cannot teach more than one course.')
[SQL: INSERT INTO STC (sno, tno, cno) VALUES (10001, 1001, 103);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%sql SELECT * FROM STC;

 * mysql://stu2100013083:***@162.105.146.37:43306
4 rows affected.

[(10001, 1001, 101),
 (10001, 1002, 102),
 (10002, 1001, 101),
 (10002, 1002, 102)]

In [19]:
%%sql
TRUNCATE TABLE STC;
TRUNCATE TABLE TC;
TRUNCATE TABLE SC;

 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.

[]

3、把𝑡𝑚𝑝𝑆𝑇𝐶中数据导入到表𝑆𝑇𝐶以及𝑆𝐶和𝑇𝐶中

In [20]:
# 插入数据到数据库
db = pymysql.connect(host='162.105.146.37',user='stu2100013083', password='stu2100013083', port=43306, db="stu2100013083")
cursor = db.cursor()

for index, row in tmpSTC.iterrows():
    try:
        sql='INSERT INTO STC(sno,tno,cno) VALUES (%s,%s,%s);'
        cursor.execute(sql,(int(row['sno']), int(row['tno']), int(row['cno'])))
        db.commit()
    except:
        db.rollback()

In [25]:
%%sql
INSERT INTO SC (sno, cno)
SELECT DISTINCT sno, cno
FROM STC
ON DUPLICATE KEY UPDATE sno = VALUES(sno), cno = VALUES(cno);

INSERT INTO TC (tno, cno)
SELECT DISTINCT tno, cno
FROM STC
ON DUPLICATE KEY UPDATE tno = VALUES(tno), cno = VALUES(cno);

 * mysql://stu2100013083:***@162.105.146.37:43306
2155 rows affected.
1000 rows affected.

[]

4、查看各表所包含的行数，统计(𝑡𝑛𝑜,𝑐𝑛𝑜)的冗余，作为3NF为维护函数依赖所付出的代价

In [26]:
%sql select count(*) from STC

 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.

[(2155,)]

In [27]:
%sql select count(*) from SC

 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.

[(2155,)]

In [28]:
%sql select count(*) from TC

 * mysql://stu2100013083:***@162.105.146.37:43306
1 rows affected.

[(1000,)]

清空表项，删除触发器和表

In [29]:
%sql DELETE FROM STC
%sql DELETE FROM TC
%sql DELETE FROM SC
%sql DROP TRIGGER `Check_STC_Before_Insert`;
%sql DROP TABLE STC
%sql DROP TABLE TC
%sql DROP TABLE SC

 * mysql://stu2100013083:***@162.105.146.37:43306
2155 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
1000 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
2155 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2100013083:***@162.105.146.37:43306
0 rows affected.

[]